android/Reservator/src/com/futurice/android/reservator/model/soap/FindItemCalendar.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types">
  <soap:Body>
    <FindItem xmlns="http://schemas.microsoft.com/exchange/services/2006/messages"
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
              Traversal="Shallow">
      <ItemShape>
        <t:BaseShape>AllProperties</t:BaseShape>
      </ItemShape>
      <CalendarView MaxEntriesReturned="9999" StartDate="{StartTime}" EndDate="{EndTime}" />
      <ParentFolderIds>
		  <t:DistinguishedFolderId Id="calendar">
		  	<t:Mailbox>
				<t:EmailAddress>{RoomAddress}</t:EmailAddress>
			</t:Mailbox>
		  </t:DistinguishedFolderId>
      </ParentFolderIds>
    </FindItem>
  </soap:Body>
</soap:Envelope>